tap "homebrew/cask"

brew "git"
brew "wget"
brew "httpie"
brew "jq"
brew "tree"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "zoxide"
brew "starship"

# Oracle tooling (CLI)
cask "temurin"   # Java runtime for SQLcl (requires Java 11+)
cask "sqlcl"     # Oracle SQL Developer Command Line (SQLcl)

cask "iterm2"
cask "rectangle"
cask "alt-tab"

# Optional packages (uncomment to install)
# cask "dbeaver-community"
# cask "postman"
# cask "intellij-idea"

# Optional local DB (only if you actually need PostgreSQL locally)
# brew "postgresql@16"
